Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: *git checkout -b working-branch upstream-branch:* Creates and checks out a working branch on your local machine. The local branch tracks the upstream branch. You can use your local branch to isolate your work. It is a good idea to use local branches when adding specific features or changes. Using isolated branches facilitates easy removal of changes if they do not work out.
it_it: *git checkout -b working-branch upstream-branch:* Crea ee esegue il checkout" di un scarica un branch di lavoro sulla macchina locale. Il branch locale traccia il branch upstream. Si può usare il proprio branch locale per isolare il proprio lavoro. È consigliabile utilizzare branch locali quando si aggiungono funzionalità specifiche o si apportano modifiche. L'utilizzo di branch isolati facilita la rimozione delle modifiche qualora non funzionassero.

source: *git checkout branch-name:* Changes your local working branch and in this form assumes the local branch already exists. This command is analogous to "cd".
it_it: *git checkout branch-name:* Cambia il branch di lavoro locale e, in questa forma, presuppone che il branch locale esista già. Questo comando è analogo a "cd".

source: *git cherry-pick commits:* Choose and apply specific commits from one branch into another branch. There are times when you might not be able to merge all the changes in one branch with another but need to pick out certain ones.
it_it: *git cherry-pick commits:* Seleziona e applica commit specifici da un branch a un altro. A volte potrebbe non essere possibile unire tutte le modifiche di un branch con un altro, ma è necessario selezionarne alcune.

source: *git clean:* Cleans the working tree by recursively removing files that are not under version control, starting from the current directory.
it_it: *git clean:* Pulisce la directory di lavoro rimuovendo ricorsivamente i file non sotto controllo di versione, a partire dalla directory corrente.

source: *git clone:* Creates a local clone of a Git repository that is on equal footing with a fellow developer's Git repository or an upstream repository.
it_it: *git clone:* Crea una copia locale di un repository Git, che si trova sullo stesso piano del repository Git di un altro sviluppatore o del repository upstream.

source: *git commit:* Creates a local "commit" that documents the changes you made. Only changes that have been staged can be committed. Commits are used for historical purposes, for determining if a maintainer of a project will allow the change, and for ultimately pushing the change from your local Git repository into the project's upstream repository.
it_it: *git commit:* Crea un "commit" locale che documenta le modifiche apportate. Solo le modifiche aggiunte all'area di staging possono essere confermate. I commit vengono utilizzati a scopo storico, per verificare se il manutentore di un progetto accetta la modifica e, infine, per inviare la modifica dal repository Git locale al repository upstream del progetto.

source: *git diff:* Displays line-by-line differences between a local working file and the same file as understood by Git. This command is useful to see what you have changed in any given file.
it_it: *git diff:* Visualizza le differenze riga per riga tra un file di lavoro locale e lo stesso file interpretato da Git. Questo comando è utile per vedere le modifiche apportate a un determinato file.

source: *git grep:* Looks for specified patterns in the tracked files in the working tree, blobs registered in the working tree, or blobs in given tree objects.
it_it: *git grep:* Cerca pattern specifici nei file tracciati nella directory di lavoro, nei blob registrati nella directory di lavoro o nei blob presenti in determinati oggetti della directory.

source: *git init:* Initializes an empty Git repository. You cannot use Git commands unless you have a ``.git`` repository.
it_it: *git init:* Inizializza un repository Git vuoto. Non è possibile utilizzare i comandi Git se non si dispone di un repository ``.git``.

source: *git log:* Reports a history of your commits to the repository. This report lists all commits regardless of whether you have pushed them upstream or not.
it_it: *git log:* Mostra la cronologia dei commit effettuati nel repository. Questo report elenca tutti i commit, indipendentemente dal fatto che siano stati inviati al repository remoto o meno.

source: *git merge:* Combines or adds changes from one local branch of your repository with another branch. When you create a local Git repository, the default branch may be named "main". A typical workflow is to create a temporary branch that is based off "main" that you would use for isolated work. You would make your changes in that isolated branch, stage and commit them locally, switch to the "main" branch, and then use the ``git merge`` command to apply the changes from your isolated branch into the currently checked out branch (e.g. "main"). After the merge is complete and if you are done with working in that isolated branch, you can safely delete the isolated branch.
it_it: *git merge:* Unisce o aggiunge le modifiche da un branch locale del proprio repository con un altro branch. Quando si crea un repository Git locale, il branch predefinito potrebbe chiamarsi "main". Un flusso di lavoro tipico prevede la creazione di un branch temporaneo basato su "main" da utilizzare per lavorare in isolamento. Si apporteranno le modifiche in questo branch isolato, si aggiungeranno all'area di staging e si sottoporranno a commit localmente, si passerà al branch "main" e quindi si userà il comando ``git merge`` per applicare le modifiche dal branch isolato al branch attualmente selezionato (ad esempio, "main"). Una volta completata la fusione e si è finito di lavorare su quel branch isolato, lo si può eliminare in tutta sicurezza.

source: *git pull \-\-rebase*: Retrieves information from an upstream Git repository and places it in your local Git repository. You use this command to make sure you are synchronized with the repository from which you are basing changes (e.g. the "blacksail" branch). The ``--rebase`` option ensures that any local commits you have in your branch are preserved at the top of your local branch.
it_it: *git pull \-\-rebase*: Recupera le informazioni da un repository Git upstream e le inserisce nel proprio repository Git locale. Questo comando viene utilizzato per garantire la sincronizzazione con il repository da cui si prendono le modifiche (ad esempio, il branch "blacksail"). L'opzione ``--rebase`` garantisce che tutti i commit locali presenti nel proprio branch vengano mantenuti all'inizio del branch locale.

source: *git push repo-name local-branch:upstream-branch:* Sends all your committed local changes to the upstream Git repository that your local repository is tracking (e.g. a contribution repository). The maintainer of the project draws from these repositories to merge changes (commits) into the appropriate branch of project's upstream repository.
it_it: *git push repo-name local-branch:upstream-branch:* Invia tutte le modifiche locali sottoposte a commit al repository Git upstream che il repository locale sta monitorando (ad esempio, un repository di contributi). Il manutentore del progetto preleva da questi repository per unire le modifiche (commit) nel branch appropriato del repository upstream del progetto.

source: *git reset:* Resets the current HEAD to the specified state.
it_it: *git reset:* Reimposta l'HEAD corrente allo stato specificato.

source: *git status:* Reports any modified files that possibly need to be staged and gives you a status of where you stand regarding local commits as compared to the upstream repository.
it_it: *git status:* Segnala eventuali file modificati che potrebbero dover essere aggiunti all'area di staging e fornisce un aggiornamento sullo stato dei commit locali rispetto al repository upstream.

source: *gitk:* Provides a GUI view of the branches and changes in your local Git repository. This command is a good way to graphically see where things have diverged in your local repository.
it_it: *gitk:* Fornisce una visualizzazione grafica dei branch e delle modifiche nel repository Git locale. Questo comando è un ottimo modo per visualizzare graficamente dove si sono verificate divergenze nel repository locale.

source: *meta-yocto "master-next" branch:* This branch is part of the :yocto_git:`meta-yocto </meta-yocto/>` repository and contains proposed changes to meta-yocto.
it_it: *meta-yocto "master-next" branch:* Questo branch fa parte del repository :yocto_git:`meta-yocto </meta-yocto/>` e contiene le modifiche proposte per meta-yocto.

source: *openembedded-core "master-next" branch:* This branch is part of the :oe_git:`openembedded-core </openembedded-core/>` repository and contains proposed changes to the core metadata.
it_it: *openembedded-core "master-next" branch:* Questo branch fa parte del repository :oe_git:`openembedded-core </openembedded-core/>` e contiene le modifiche proposte ai metadati del core.

source: *recipes-\*:* Recipes and append files that affect common functionality across the distribution. This area could include recipes and append files to add distribution-specific configuration, initialization scripts, custom image recipes, and so forth. Examples of ``recipes-*`` directories are ``recipes-core`` and ``recipes-extra``. Hierarchy and contents within a ``recipes-*`` directory can vary. Generally, these directories contain recipe files (``*.bb``), recipe append files (``*.bbappend``), directories that are distro-specific for configuration files, and so forth.
it_it: *recipes-\*:* Ricette e file di append che influenzano le funzionalità comuni a tutta la distribuzione. Quest'area potrebbe includere ricette e file di append per aggiungere configurazioni specifiche della distribuzione, script di inizializzazione, ricette di immagini personalizzate e così via. Esempi di directory ``recipes-*`` sono ``recipes-core`` e ``recipes-extra``. La gerarchia e il contenuto all'interno di una directory ``recipes-*`` possono variare. In genere, queste directory contengono file di ricette (``*.bb``), file di aggiunta alle ricette (``*.bbappend``), directory specifiche della distribuzione per i file di configurazione e così via.

source: *site.conf:* You can use the :ref:`structure-build-conf-site.conf` configuration file to configure multiple build directories. For example, suppose you had several build environments and they shared some common features. You can set these default build properties here. A good example is perhaps the packaging format to use through the :term:`PACKAGE_CLASSES` variable.
it_it: *site.conf:* Si può utilizzare il file di configurazione :ref:`structure-build-conf-site.conf` per configurare più directory di build. Ad esempio, supponiamo di avere diversi ambienti di build che condividono alcune caratteristiche comuni. Si possono impostare queste proprietà di build predefinite qui. Un buon esempio potrebbe essere il formato di packaging da utilizzare tramite la variabile :term:`PACKAGE_CLASSES`.

source: :doc:`/overview-manual/concepts` *:* This chapter presents various concepts regarding the Yocto Project. You can find conceptual information about components, development, cross-toolchains, and so forth.
it_it: :doc:`/overview-manual/concepts` *:* Questo capitolo presenta diversi concetti relativi a Yocto Project. Si troveranno informazioni concettuali su componenti, sviluppo, toolchain cross-compilation e altro ancora.

source: :doc:`Reproducible </test-manual/reproducible-builds>`
it_it: :doc:`Riproducibile </test-manual/reproducible-builds>`

source: :ref:`bitbake:ref-bbsetup-command-init` is an interactive program by default and will ask you to make some decisions. Depending on your answers, the output may differ from the examples below.
it_it: :ref:`bitbake:ref-bbsetup-command-init` è un programma interattivo per default e chiederà di prendere alcune decisioni. A seconda delle risposte, l'output potrebbe differire dagli esempi seguenti.

source: :ref:`overview-manual/development-environment:the yocto project development environment`\ *:* This chapter helps you get started understanding the Yocto Project development environment. You will learn about open source, development hosts, Yocto Project source repositories, workflows using Git and the Yocto Project, a Git primer, and information about licensing.
it_it: :ref:`overview-manual/development-environment:the yocto project development environment`\ *:* Questo capitolo illustrerà l'ambiente di sviluppo di Yocto Project. In questo si conoscerà l'open source, gli host di sviluppo, i repository del codice sorgente di Yocto Project, i flussi di lavoro che utilizzano Git e Yocto Project, un'introduzione a Git e informazioni sulle licenze.

source: :ref:`overview-manual/yp-intro:introducing the yocto project`\ *:* This chapter provides an introduction to the Yocto Project. You will learn about features and challenges of the Yocto Project, the layer model, components and tools, development methods, the :term:`Poky` reference distribution, the :term:`OpenEmbedded Build System` workflow, and some basic Yocto terms.
it_it: :ref:`overview-manual/yp-intro:introducing the yocto project`\ *:* Questo capitolo fornisce un'introduzione a Yocto Project. Si vedranno le caratteristiche e le sfide di Yocto Project, il modello a layer, i componenti e i tool, i metodi di sviluppo, la distribuzione di riferimento :term:`Poky`, il flusso di lavoro di :term:`OpenEmbedded Build System` e alcuni termini base di Yocto.

source: :ref:`ptest <test-manual/ptest:testing packages with ptest>`: Runs tests against packages produced during the build for a given piece of software. The test allows the packages to be run within a target image.
it_it: :ref:`ptest <test-manual/ptest:testing packages with ptest>`: Esegue test sui pacchetti prodotti durante la compilazione di un determinato software. Il test consente di eseguire i pacchetti all'interno di un'immagine target.

source: :ref:`ref-classes-insane`: This class checks the generated output from builds for sanity. For example, if building for an ARM target, did the build produce ARM binaries. If, for example, the build produced PPC binaries then there is a problem.
it_it: :ref:`ref-classes-insane`: Questa classe verifica la validità dell'output generato dalle build. Ad esempio, se la build è destinata a un target ARM, controlla se sono stati prodotti binari ARM. Se, ad esempio, la build produce binari PPC, allora c'è un problema.

source: :ref:`ref-classes-sanity`: This automatically included class checks the build environment for missing tools (e.g. ``gcc``) or common misconfigurations such as :term:`MACHINE` set incorrectly.
it_it: :ref:`ref-classes-sanity`: Questa classe, inclusa automaticamente, verifica la presenza di strumenti mancanti nell'ambiente di build (ad esempio ``gcc``) o di errori di configurazione comuni, come ad esempio un parametro :term:`MACHINE` impostato in modo errato.

source: :ref:`ref-classes-sbom-cve-check` will then capture this information and change the CVE status to ``Patched`` in the generated reports.
it_it: :ref:`ref-classes-sbom-cve-check` acquisirà quindi queste informazioni e modificherà lo stato del CVE in ``Patched`` nei report generati.

source: :ref:`ref-classes-testimage`: This class performs runtime testing of images after they are built. The tests are usually used with :doc:`QEMU </dev-manual/qemu>` to boot the images and check the combined runtime result boot operation and functions. However, the test can also use the IP address of a machine to test.
it_it: :ref:`ref-classes-testimage`: Questa classe esegue test a runtime sulle immagini dopo la loro creazione. I test vengono solitamente utilizzati con :doc:`QEMU </dev-manual/qemu>` per avviare le immagini e verificare il risultato combinato dell'avvio e le relative funzionalità. Tuttavia, il test può anche utilizzare l'indirizzo IP di una macchina.

source: :ref:`ref-tasks-compile` --- runs ``make`` with arguments that specify the compiler and linker. You can pass additional arguments through the :term:`EXTRA_OEMAKE` variable.
it_it: :ref:`ref-tasks-compile` --- esegue ``make`` con argomenti che specificano il compilatore e il linker. È possibile passare argomenti aggiuntivi tramite la variabile :term:`EXTRA_OEMAKE`.

source: :ref:`ref-tasks-compile`: Once a configuration task has been satisfied, BitBake compiles the source using the :ref:`ref-tasks-compile` task. Compilation occurs in the directory pointed to by the :term:`B` variable. Realize that the :term:`B` directory is, by default, the same as the :term:`S` directory.
it_it: :ref:`ref-tasks-compile`: Una volta completato un task di configurazione, BitBake compila il codice sorgente utilizzando il task :ref:`ref-tasks-compile`. La compilazione avviene nella directory indicata dalla variabile :term:`B`. Si noti che la directory :term:`B` è, per default, la stessa della directory :term:`S`.

source: :ref:`ref-tasks-configure` --- regenerates the configure script (using ``autoreconf``) and then launches it with a standard set of arguments used during cross-compilation. You can pass additional parameters to ``configure`` through the :term:`EXTRA_OECONF` or :term:`PACKAGECONFIG_CONFARGS` variables.
it_it: :ref:`ref-tasks-configure` --- rigenera lo script di configurazione (utilizzando ``autoreconf``) e lo avvia con un set standard di argomenti utilizzati durante la compilazione incrociata. È possibile passare parametri aggiuntivi a ``configure`` tramite le variabili :term:`EXTRA_OECONF` o :term:`PACKAGECONFIG_CONFARGS`.

source: :ref:`ref-tasks-configure`: This task configures the source by enabling and disabling any build-time and configuration options for the software being built. Configurations can come from the recipe itself as well as from an inherited class. Additionally, the software itself might configure itself depending on the target for which it is being built.
it_it: :ref:`ref-tasks-configure`: Questo task configura il codice sorgente abilitando e disabilitando le opzioni di configurazione e di fase di compilazione per il software in fase di build. Le configurazioni possono provenire dalla ricetta stessa, così come da una classe ereditata. Inoltre, il software stesso potrebbe configurarsi a seconda del target per cui viene compilato.

source: :ref:`ref-tasks-install` --- runs ``make install`` and passes in ``${``\ :term:`D`\ ``}`` as ``DESTDIR``.
it_it: :ref:`ref-tasks-install` --- esegue ``make install`` e passa in ``${``\ :term:`D`\ ``}`` come ``DESTDIR``.

source: :ref:`ref-tasks-install`: After compilation completes, BitBake executes the :ref:`ref-tasks-install` task. This task copies files from the :term:`B` directory and places them in a holding area pointed to by the :term:`D` variable. Packaging occurs later using files from this holding directory.
it_it: :ref:`ref-tasks-install`: Al termine della compilazione, BitBake esegue il task :ref:`ref-tasks-install`. Questo task copia i file dalla directory :term:`B` e li posiziona in un'area temporanea indicata dalla variabile :term:`D`. La creazione del pacchetto avviene successivamente utilizzando i file presenti in questa directory di appoggio.

source: :ref:`ref-tasks-prepare_recipe_sysroot`: This task sets up the two sysroots in the ``${``\ :term:`WORKDIR`\ ``}`` (i.e. ``recipe-sysroot`` and ``recipe-sysroot-native``) so that the subsequent tasks of the recipe (notably :ref:`ref-tasks-configure` and :ref:`ref-tasks-compile`) can access the libraries, headers, and similar files built by the recipes on which it depends.
it_it: :ref:`ref-tasks-prepare_recipe_sysroot`: Questo task configura le due directory di sistema (sysroot) nella directory ``${``\ :term:`WORKDIR`\ ``}`` (ovvero ``recipe-sysroot`` e ``recipe-sysroot-native``) in modo che i task successivi della ricetta (in particolare :ref:`ref-tasks-configure` and :ref:`ref-tasks-compile`) possano accedere alle librerie, ai file header e ad altri file simili creati dalle ricette da cui dipende.

source: :term:`Append Files`
it_it: :term:`File Append`

source: :term:`BB_HASHSERVE_UPSTREAM`, when ``BB_HASHSERVE = "auto"``, allowing to connect the local server to an upstream one.
it_it: :term:`BB_HASHSERVE_UPSTREAM`, quando ``BB_HASHSERVE = "auto"``, consente di connettere il server locale a un server upstream.

source: :term:`BB_TASKHASH`: The hash of the currently running task.
it_it: :term:`BB_TASKHASH`: L'hash del task attualmente in esecuzione.

source: :term:`BPN`: The name of the recipe used to build the package. The :term:`BPN` variable is a version of the :term:`PN` variable but with common prefixes and suffixes removed.
it_it: :term:`BPN`: Il nome della ricetta utilizzata per creare il pacchetto. La variabile :term:`BPN` è una versione della variabile :term:`PN` ma senza prefissi e suffissi comuni.

source: :term:`BUGTRACKER`: the URL upstream projects bug tracking website, if applicable.
it_it: :term:`BUGTRACKER`: l'URL del sito web di tracciamento dei bug del progetto upstream, se applicabile.

source: :term:`Build Directory`
it_it: :term:`Directory di Build`

source: :term:`Build Host`
it_it: :term:`Host di Build`

source: :term:`COMPATIBLE_MACHINE`: A regular expression that resolves to one or more target machines with which the recipe is compatible.
it_it: :term:`COMPATIBLE_MACHINE`: Un'espressione regolare che si risolve in una o più macchine di destinazione con cui la ricetta è compatibile.

source: :term:`Classes`
it_it: :term:`Classi`

source: :term:`Configuration File`
it_it: :term:`File di Configurazione`

source: :term:`Configuration files <Configuration File>` provide many basic variables that define a build environment. To show a list of possible variables to configure from :term:`configuration files <Configuration File>`, see the :oecore_path:`local.conf.sample <meta/conf/templates/default/local.conf.sample>` file in :term:`OpenEmbedded-Core (OE-Core)`:
it_it: I :term:`File di configurazione <Configuration File>` forniscono numerose variabili di base che definiscono un ambiente di build. Per visualizzare un elenco delle possibili variabili per configurare tramite i :term:`file di configurazione <Configuration File>`, consultare il file :oecore_path:`local.conf.sample <meta/conf/templates/default/local.conf.sample>` in :term:`OpenEmbedded-Core (OE-Core)`:

source: :term:`DEFAULTTUNE`: Machines use tunings to optimize machine, CPU, and application performance. These features --- collectively known as "tuning features" --- are set in the :term:`OpenEmbedded-Core (OE-Core)` layer. In this example, the default tuning file is :oe_git:`tune-cortexa8 </openembedded-core/tree/meta/conf/machine/include/arm/armv7a/tune-cortexa8.inc>`.
it_it: :term:`DEFAULTTUNE`: Le macchine utilizzano delle ottimizzazioni per migliorare le prestazioni della macchina, della CPU e delle applicazioni. Queste funzionalità, note collettivamente come "tuning features", sono impostate nel layer :term:`OpenEmbedded-Core (OE-Core)` layer. In this example, the default tuning file is :oe_git:`tune-cortexa8 </openembedded-core/tree/meta/conf/machine/include/arm/armv7a/tune-cortexa8.inc>`.

source: :term:`DEPLOY_DIR`: Defined as ``tmp/deploy`` in the :term:`Build Directory`.
it_it: :term:`DEPLOY_DIR`: Definita come ``tmp/deploy`` nella :term:`Build Directory`.

source: :term:`DEPLOY_DIR`: Points to the ``deploy`` directory.
it_it: :term:`DEPLOY_DIR`: Indica la directory ``deploy``.
